In [1]:
from ravenclaw.wrangling import join_wisely
from ravenclaw.example_dataframes import lotr

C:\code\idin\Anaconda3\lib\site-packages\statsmodels\compat\pandas.py:56: FutureWarning: The pandas.core.datetools module is deprecated and will be removed in a future version. Please use the pandas.tseries module instead.
  from pandas.core import datetools

In [2]:
df1 = lotr

In [10]:
df1 = lotr.drop(labels=[0, 1])
df2 = lotr #.drop(labels=[2, 3])

In [11]:
df1

   number  firstname lastname        date
2       2    Gandalf     None  2018-06-07
3       3    Legolas     None  2018-06-08
4       4    Saruman     None  2018-06-09
5       5      Bilbo  Baggins  2018-06-10
6       6     Gollum     None  2018-06-11
7       7      Arwen     None  2018-06-12
8       8  Galadriel     None  2018-06-13
9       9    Boromir     None  2018-06-14

In [12]:
df2

   number  firstname lastname        date
0       0      Frodo  Baggins  2018-06-05
1       1    Aragorn     None  2018-06-06
2       2    Gandalf     None  2018-06-07
3       3    Legolas     None  2018-06-08
4       4    Saruman     None  2018-06-09
5       5      Bilbo  Baggins  2018-06-10
6       6     Gollum     None  2018-06-11
7       7      Arwen     None  2018-06-12
8       8  Galadriel     None  2018-06-13
9       9    Boromir     None  2018-06-14

In [13]:
wise_join = join_wisely(left=df1, right=df2, on='number')

In [14]:
wise_join['left_only']

Empty DataFrame
Columns: [number, firstname, lastname, date]
Index: []

In [15]:
wise_join['both']

,number,firstname_x,lastname_x,date_x,firstname_y,lastname_y,date_y
0,2,Gandalf,None,2018-06-07,Gandalf,None,2018-06-07
1,3,Legolas,None,2018-06-08,Legolas,None,2018-06-08
2,4,Saruman,None,2018-06-09,Saruman,None,2018-06-09
3,5,Bilbo,Baggins,2018-06-10,Bilbo,Baggins,2018-06-10
4,6,Gollum,None,2018-06-11,Gollum,None,2018-06-11
5,7,Arwen,None,2018-06-12,Arwen,None,2018-06-12
6,8,Galadriel,None,2018-06-13,Galadriel,None,2018-06-13
7,9,Boromir,None,2018-06-14,Boromir,None,2018-06-14

In [16]:
wise_join['right_only']

   number firstname lastname        date
0       0     Frodo  Baggins  2018-06-05
1       1   Aragorn     None  2018-06-06

In [17]:
wise_join

{'left_only': Empty DataFrame
 Columns: [number, firstname, lastname, date]
 Index: [], 'right_only':    number firstname lastname        date
 0       0     Frodo  Baggins  2018-06-05
 1       1   Aragorn     None  2018-06-06, 'both':    number firstname_x lastname_x      date_x firstname_y lastname_y  \
 0       2     Gandalf       None  2018-06-07     Gandalf       None
 1       3     Legolas       None  2018-06-08     Legolas       None
 2       4     Saruman       None  2018-06-09     Saruman       None
 3       5       Bilbo    Baggins  2018-06-10       Bilbo    Baggins
 4       6      Gollum       None  2018-06-11      Gollum       None
 5       7       Arwen       None  2018-06-12       Arwen       None
 6       8   Galadriel       None  2018-06-13   Galadriel       None
 7       9     Boromir       None  2018-06-14     Boromir       None

        date_y
 0  2018-06-07
 1  2018-06-08
 2  2018-06-09
 3  2018-06-10
 4  2018-06-11
 5  2018-06-12
 6  2018-06-13
 7  2018-06-14  }